Зарплата_и_Управление_Персоналом/src/InformationRegisters/СведенияОбАккредитацияхСпециалистов/СведенияОбАккредитацияхСпециалистов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОбАккредитацияхСпециалистов</name>
  <resources>
    <name>ВидПроцедуры</name>
    <type>
      <types>CatalogRef.ВидыПроцедурАккредитацииСпециалистов</types>
    </type>
  </resources>
  <resources>
    <name>ПрофессиональныйСтандарт</name>
    <type>
      <types>CatalogRef.ПрофессиональныеСтандарты</types>
    </type>
  </resources>
  <resources>
    <name>НомерПротокола</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МестоПроведения</name>
    <type>
      <types>CatalogRef.УчебныеЗаведения</types>
    </type>
  </resources>
  <resources>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РегистрационныйНомерСвидетельства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачиСвидетельства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньОбразования</name>
    <type>
      <types>CatalogRef.ВидыОбразованияФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециальностьПоОбразованию</name>
    <type>
      <types>CatalogRef.КлассификаторСпециальностейПоОбразованию</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельностиСпециалистов</types>
    </type>
  </attributes>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Специальность</name>
    <type>
      <types>CatalogRef.КлассификаторСпециальностейПоОбразованию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПротокола</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Зарплата_и_Управление_Персоналом/src/InformationRegisters/СведенияОбАккредитацияхСпециалистов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПредставлениеАккредитацийСпециалиста(ФизическоеЛицоСсылка) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизическоеЛицоСсылка", ФизическоеЛицоСсылка);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОбАккредитацияхСпециалистов.Специальность КАК Специальность,
		|	МАКСИМУМ(СведенияОбАккредитацияхСпециалистов.ДействуетДо) КАК ДействуетДо
		|ИЗ
		|	РегистрСведений.СведенияОбАккредитацияхСпециалистов КАК СведенияОбАккредитацияхСпециалистов
		|ГДЕ
		|	СведенияОбАккредитацияхСпециалистов.ФизическоеЛицо = &ФизическоеЛицоСсылка
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОбАккредитацияхСпециалистов.Специальность";
		
	КоллекцияЗаписей = Запрос.Выполнить().Выгрузить();
	
	ПредставлениеАккредитаций = "";
	Для Каждого СтрокаАккредитации Из КоллекцияЗаписей Цикл
		ПредставлениеАккредитаций 	= 
			ПредставлениеАккредитаций
			+ ?(ПустаяСтрока(ПредставлениеАккредитаций), "", ", ") 
			+ ?(ЗначениеЗаполнено(СтрокаАккредитации.Специальность), Строка(СтрокаАккредитации.Специальность), "")
			+ ?(ЗначениеЗаполнено(СтрокаАккредитации.ДействуетДо), НСтр("ru = ' до '")  // АПК:1299 
			+ Формат(СтрокаАккредитации.ДействуетДо, "ДЛФ=ДД"), "");
	КонецЦикла;
	
	Если ПустаяСтрока(ПредставлениеАккредитаций) Тогда
		ПредставлениеАккредитаций = НСтр("ru = 'Не имеет аккредитаций'");
	КонецЕсли; 
	
	Возврат ПредставлениеАккредитаций;
	
КонецФункции

#КонецОбласти

#КонецЕсли
